{
    "intents": [
        {
            "tag": "neutral",
            "patterns": [
                "The taste was very good. But the crust could be more crispy.both the pizza were good and the toppings were delicious too. I enjoyed both of them.",
                ""
            ],
            "responses": [
                "Hello {user}, thanks for sharing your opinion. We'll try our best to improve our service",
                "Thank you so much for the review.",
                "Dear {user}, thank you for the review.",
                "Dear {user}, Thank you for your suggestions. We will try and incorporate them."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "negative",
            "patterns": [
                "It's useless to have a 20% discount on an order after paying for the membership. It's just not worth it. I would have happly paid more if you wanted guys increased the price of the membership rather than doing this. Before that I couldn't have thought of an app which could have competed with the great gaint  Zomato but now , I think otherwise . Someone out there has an opportunity now.",
                "Too many ads an notification added now, also their pro membership is not good for end user. Also to make sure it shows delivery on time, their delivery clocks adjusted automatically. What is wrong with the surge price for no reason.",
                "The change from Zomato Gold to Zomato Pro, has been the worst experience... As a Pro Member I am uninstalling this app... Price is over inflated... Swiggy and Box 8 is much better... I would highly recommend not to use this app, as they have fooled all Zomato Gold members.. We need our money back, or give us Zomato Gold back...",
                "Worst experince & service quality is bad infact they cheated customers ......never order through it",
                "I hate this place really bad",
                "Worst restaurant",
                "poor service",
                "bad food",
                "Food tastes stale.",
                "Food is real not in condition to eat ...daal is look and taste like stale.",
                "butter chicken was worst",
                "I am very disappointed with Zomato.",
                "total waste of money",
                "They give the delivery guy 2 orders, for 2 different locations far from each others, and if your order is second to be delivered, so ur food willbe cold by the time it reaches you.",
                "Don't buy food with online transaction, better to go for cash on delivery. Zomato Team is not giving proper response for failed transactions.",
                "The pizza's were hopeless they are looking too messy and Packing was very poor and the taste of pizza was horrible. The presentation of the pizza was horrible and hopeless. We find a hair on the pizza and the jalapeno dip was also fermented."
            ],
            "responses": [
                "Hi {user}, we realize your experience hasn't been at par with your expectations. However, we'd like to learn more about your situation and what exactly happened. Contact us via: {website} with the specific transaction ID. We want to make things right for you.",
                "Hi there, we understand your concern. We are sorry that you had to go through this. We request you to contact us via: {website} and we'll look into it.",
                "Hi {user}, we apologize for the inconvenience caused. Request you to share thedetails here or you could reply to the same ticket raised via the app. We'll surely get this checked for you. Thanks.",
                "Sorry to hear that, {user}. We're here to assist you. Request you to share the details via email {email}. We assure you to get it resolved at the earliest.",
                "Hey {user}! We sincerely apologise for the inconvenience caused.",
                "Hi {user}, sorry for the inconvenience caused. Can you please share the details of the issue?",
                "Hi {user}, we would like to know what went wrong and fix the issue. Please raise your concern by clicking on the link: {website}, so that we can look into it immediately. It is our constant endeavor to provide seamless experience to all our users.",
                "Hey {user}, this doesn't sound right. Please call us or visit our website at {website} to share more details with us. We will look into it and work on resolving it at the earliest. Thank you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "positive",
            "patterns": [
                " a favorite place of mine for Delicious Indian food and Chatpati chaat. Perfect place, Good customer service & Polite staff.",
                "Awesome, thanks",
                "Best outlet. Best pizza's in town. Tasty and delicious. Properly baked. Love the toppings. So hygienic and so fresh.",
                "worth the money",
                "The quality they serve is excellent. I really love this outlet.",
                "amazing food",
                "Pizzas from them are the best. I had Farmhouse pizza , supreme onion pizza , country special , cheesy pizza , chicken tikka pizza like many to tell you guys but do try them out and sorry for the picture it's a little blur but go for the taste it's damn good.",
                "It's a budget friendly MNC to have pizza ,it provides pizzas with a variety of range .I had wide spectrum of pizzas and ranging from budget friendly to luxurious. Talking about the quality of food,it's amazing.",
                "Best restaurant",
                "Awesome restaurant",
                "Very delicious food"
            ],
            "responses": [
                "Thank you for your support {user}. Happy to help!",
                "Thank you very much {user}.",
                "Hi {user}, thanks for the wonderful review. Cheers :)",
                "Thank you for the kind review :)"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "spam",
            "patterns": [
                "This is really a fake app",
                "Don't download fake app"
            ],
            "responses": [
                "Hi {user}, how can we help you?",
                "Hi, please tell us your concern.",
                "Please let us know how we can help you",
                "Hi {user}, please call {phone} or write to us at {email}.",
                "Hello {user}, please specify your concern"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "support",
            "patterns": [
                "I need support",
                "I would like to contact support",
                "Customercare contact"
            ],
            "responses": [
                "Hi {user}, how can we help you?",
                "Dear {user}, please contact us via email {email} or phone {phone}.",
                "Hi {user}, sorry for the inconvenience caused. Can you please share the details of your issue?"
            ],
            "context": [
                ""
            ]
        }
    ]
}